{
    "certifications": [
        "AWS Solutions Architect - Associate Level",
        "AWS Solutions Architect – Professional level"
    ],
    "education": {
        "degree": "Bachelor of Technology Degree in Science",
        "institution": "Nagarjuna University",
        "graduation": "N/A",
        "courses": [
            "PGDSE from Neosoft Technology Institutions"
        ],
        "gpa": null
    },
    "experiences": [
        {
            "company": "Accenture IN",
            "role": "AWS Cloud Engineer",
            "dates": [
                "February 2016",
                "June 2017"
            ],
            "responsibilities": [
                "Handled AWS Cloud Operations starting from Design till Application delivery. Created migration plan to AWS public Cloud regions, designed architecture models compliant with security policies. Leading the team of Cloud Engineers and handling cloud operations like EC2, EBS, RDS, VPC, ELB, Autoscalingetc. and Designing Database High Availability Solutions on MS SQL & MySQL Multi-AZ RDS. Created, configured and implemented Virtual Private Cloud (VPC), Security Groups, Network Access Control List (NACL), Elastic Compute Cloud (EC2 instances), Elastic Block Store (EBS), Simple Storage Service (S3), Elastic Load Balancer (ELB), RDSMySQL, Subnets, Snapshots, Auto-Scaling groups, Route 53 DNS, Glacier, Elastic File System (EFS), Cloud Front, Cloud Watch, Cloud Trail. Assigned Roles and Policies to Users, Security Groups by using Identity and Access Management. Gave architecture guidance for selected Business Units, assessing migration feasibility and deployment strategy based on AWS Architecture best practices. Designed and deployed company-wide security training for all employees, wrote formal security incident response plan, overhauled public vulnerability reporting process, and wrote extensive documentation on security processes and best practices. Worked on Ingress and egress of data to and from AWS. Designed, built, and deployed a multitude application utilizing the AWS stack (Including EC2, R53, S3, RDS, DynamoDB, SQS, IAM, and EMR), focusing on high-availability, fault tolerance, and auto-scaling. Developed Disaster Recovery Plan and Business Continuity proposal utilizing AWS Services. Resolved AWS Network Infrastructure Issues, troubleshoot HPC Performance and HA Configuration. Experienced in designing and configuring VPC - CIDR block, subnet's, security groups, NACL's, Route Tables, direct connect and VPN."
            ]
        },
        {
            "company": "Accenture IN",
            "role": "AWSCloud Engineer",
            "dates": [
                "March 2014",
                "January 2016"
            ],
            "responsibilities": [
                "Integrated Maven with Perforce to manage and deploy project related tags. Installed and administered Tomcat repository to deploy the artifacts generated by Maven and to store the dependent jars which are used during the build. Mentor Business Areas on Subversion Branching, Merging strategies concepts. Resolved update, merge and password authentication issues in Jenkins and Jira. Created Ansible supported YML scripts to restart JBoss, Tomcat, Jetty servers through GUI. Created Ansible playbooks for various automation purpose, file copy, permission changes, configuration changes, path-specific folder creation, etc. Setting up continuous integration and formal builds using Jenkins with Maven and Tomcat repository. Involved partially in deploying WARs/EARs (backend) through Apache Tomcat Application Server console. Used Shell script to configure the Apache Tomcat application server in all the environments Support Lead developers with Configuration Management issues. Worked for Creating the Software Configuration Management Plan. Managed all the bugs and changes into a production environment using the Jira tracking tool Managed the entire release communication and Release coordination during the Project roll-out Involved in estimating the resources required for the project based on the requirements."
            ]
        },
        {
            "company": "Henkel - Accenture IN",
            "role": "VMware Consultant",
            "dates": [
                "January 2013",
                "February 2014"
            ],
            "responsibilities": [
                "Installing and configuration of vCenter Server and building a Highly Available VMware Infra Structure HA (High Availability), DRS (Distributed Resource Scheduler) management & Troubleshooting. Managing ESXi servers in a Cluster environment. Creating, Increasing Datastores. Planning & Executing P2V (Physical to Virtual), V2V conversions using VMware Converter Standalone& management consoles. Management of vSwitches, VM kernel, Service console configurations. Managing vMotion and storage VMotion solutions. Installing, configuring & Managing Virtual Machines with versions. Resource Management & Capacity Monitoring on the vCenter server. Configure Virtual SAN networking, Configure a Virtual SAN cluster. Test and validate the Virtual SAN configuration and functionality Virtual SAN Policies and Virtual Machines Implementing Storage Policy, Implementing virtual machine storage policy Managing and Operating Virtual SAN, Manage hardware storage devices Manage hardware device failures, Identify vCenter Server alarms for Virtual SAN events Configure fault domains, Upgrade to Virtual SAN 6.2. Configuration of Diskgroups and VSAN Involved with the team for building VMware vrealize automation center on vSAN Cluster"
            ]
        },
        {
            "company": "Wipro",
            "role": "VMware Engineer",
            "dates": [
                "December 2009",
                "December 2012"
            ],
            "responsibilities": [
                "Installing and configuration of VMware vSphere 6.0, vCenter Server 6.0 and VMware View 6.0 Installing and configuring of vCenter server with High Availability best practices Planning and implementation of VMware View Connection Server, Composer server. Configure external database for connection View composer server. Implementation and configuration of shared desktop pools with server 2012 as a desktop Configured VCOPS for monitoring the view environment. Enabled automatic report as per the client requirement in VCOPS Implementation of Application pools for application like MS Office and other software’s Implementation of Dedicated desktop pools as per the client requirements Microsoft group policies for PCoIP and network enhancements Configured GPO policies for user roaming profiles The configuration of a file server for user data on the shared desktop pools."
            ]
        },
        {
            "company": "Proximus - Wipro - IN",
            "role": "System Administrator",
            "dates": [
                "January 2007",
                "November 2009"
            ],
            "responsibilities": [
                "Configuration, operation, and troubleshooting of BGP, OSPF, EIGRP, RIP routing protocol in Cisco Routers & L3 Switches. Configuration of Printer, Modem, Scanner. The configuration of Domain Naming Server (DNS). The configuration of Dynamic Host Configuration Protocol. Configuration and Managing Remote Installation Service (RIS). Configured New WAN links and Monitor Network Performance. Installation of Operating Systems Win98, Win XP, Win NT, Win 2000, Win 2003 etc. System Troubleshooting in case of a failure and maintain server uptime above 99.99%. Working hands-on experience on Cisco routers & switches, Cisco ASA, Checkpoint, Juniper and FortiGate firewalls. Migration of active directory services from Win NT to Win 2k to Win 2003. Provided Capacity Planning review for all the servers. Patched all Windows servers and workstations with Company standards. Configured & administered Domain Naming Server (DNS), Dynamic Host Configuration Protocol (DHCP), Distributed File System. (DFS), Internet Information Service. (IIS) and Remote Access Service (RAS). Train and orients staff on the use of hardware and software."
            ]
        },
        {
            "company": "USFOODS – Rosemont, IL",
            "role": "AWS Architect",
            "dates": [
                "November 2017",
                "Present"
            ],
            "responsibilities": [
                "Involved in designing and deploying infrastructure using almost all the AWS cloud infrastructure focusing on high availability, fault tolerance and auto-scaling of the instances. Maintained the user access using IAM policies and roles, on services like VPC, RDB, Dynamo DB, SES, SQS and SNS services in AWS cloud. Configured Kinesis firehouse, Integrated with S3 services. Configured DynamoDb, created monitoring and alerting alarm’s and also created multiple tables in DynamoDB. Provisioned MYSQL and Aurora DB using cloud formation templates. Helped in migrating and managing multiple applications from on-premise to cloud using AWS VMware vCenter appliance. Have developed automation process for client using CloudFormations , CloudFront . Developed service CatLog’s, Implemented SNS services for application owners. Worked with multiple applications like SAS, Ecommerce,SecurityAPI’s, UPC . Converting existing AWS infrastructure to Server-less architecture (AWS Lambda, Kinesis) deployed via AWS Cloud formation. Created or converted existing logging system to utilize Cloudwatch logging with auto-generated lambdas. Converted existing terraform modules that had version conflicts to utilize cloud formation during terraform deployments to enable more control or missing capabilities Worked with team to replace our reliance on databases by using S3 storage or cache to reduce AWS costs. Backup and restore of AWS instances, automated the process using Lamda. Configured and maintained user accounts for Dev, QA and production teams and created roles for EC2, RDS, S3, Cloud Watch, EBS resources to communicate with each other using IAM. Configured SNS, SQS, Data Pipeline, RDS, DynamoDB, S3, IAM, Cloud Front and ELB to setup environment ready for Codification."
            ]
        },
        {
            "company": "LFG– Omaha, NE",
            "role": "AWS Architect",
            "dates": [
                "July 2017",
                "October 2017"
            ],
            "responsibilities": [
                "Involved in designing and deploying infrastructure using almost all the AWS cloud infrastructure focusing on high availability, fault tolerance and auto-scaling of the instances. Maintained the user access using IAM policies and roles, on services likeVPC, RDB, Dynamo DB, SES, SQS and SNS services in AWS cloud. Helped in migrating and managing multiple applications from on-premise to cloud using AWS VMware vCenterappliance. Worked on automation platforms like Ansible, Chef. Converting existing AWS infrastructure to Server-less architecture (AWS Lambda, Kinesis) deployed via AWS Cloud formation. Created or converted existing logging system to utilize Cloudwatch logging with auto-generated lambdas. Converted existing terraform modules that had version conflicts to utilize cloud formation during terraform deployments to enable more control or missing capabilities Worked with team to replace our reliance on databases by using S3 storage or cache to reduce AWS costs. PCI DSS Compliance Testing and patching and rollbacks. PCI & SOX audit preparation and interaction with QSA. Trustwave PCI & SOX compliance audits and security system administration. Symantec DLP Enterprise PCI & data security design and day to day administration. Configured and maintained user accounts for Dev, QA and production teams and created roles for EC2, RDS, S3, Cloud Watch, EBS resources to communicate with each other using IAM. Created and Configured Red Hat, Windows Server, Ubuntu, CentOS, Solaris and Fedora Virtual Machines in AWS using EC2, ElasticIP, VPC, Subnets, RouteTables, NATGateway. Configured SNS, SQS, Data Pipeline, RDS, DynamoDB, S3, IAM, Cloud Front and ELB to setup environment ready for Codification. Cloud Security experience with IBM Qradar 7x, Rapid7 Nexpole 5.x Architected and designed Rapid deployment method using Ansible to auto-deploy servers as needed. Deployed Puppet and Puppet DB for configuration management to existing infrastructure. Linux and Windows servers upgrade and Patching. Performance troubleshoots and root cause investigation Enforcing Test Driven Development (TDD) approach for writing Chef Cookbook using Test-kitchen, Vagrant, Berkshelf, FoodCritic and ChefSpec. Using Chef deployed and configured Elastic search, Log stash and Kibana (ELK) for log analytics, full-text search, application monitoring in integration with AWS Lambda and Cloud Watch."
            ]
        }
    ],
    "projects": [],
    "honors": [],
    "activities": [],
    "userDetails": {
        "name": "Raghu Dornala",
        "skills": [
            "Cloud",
            "Amazon Web services (AWS), OpenStack",
            "EC2, RDS, ELB,S3, Route 53, ElastiCache, IAM, Cloud Watch, Kinesis , Lamda ,Cloud Formation, EBS, SNS, AWS Resource groups etc",
            "GIT, GIT Hub, Subversion (SVN), Code Commit, TFS",
            "Apache, Tomcat",
            "Puppet, Maven, Docker, Ansible",
            "Java,Python, People Code",
            "RDS,Red Shift,DynamoDB , NoSQL ,MS SQL Server, Oracle",
            "Shell Scripting, Java, Bash, Python etc",
            "Microsoft Windows, Linux, Sun Solaris, Fedora, AIX etc",
            "SNMP, SMTP, TCP/IP, IPX/SPX, OSPF, BGP, IGRP, EIGRP, PPP, DNS.S, SLIP, UUCP, X. 25, LAN, WAN, ARP/RARP, FTP/TFTP, DHCP"
        ]
    }
}