{
    "certifications": [],
    "education": {
        "institution": "Geothe Institute Max Muller Bhavan Bangalore",
        "courses": [
            "A1 level of German Language"
        ],
        "degree": "",
        "graduation": "2014",
        "gpa": null
    },
    "experiences": [
        {
            "company": "Alpha Consultantz, Bangalore",
            "role": "HR Executive (Recruitments) ",
            "dates": [
                "April 2015",
                "Sept 2017"
            ],
            "responsibilities": [
                "Overall 6.04 years of experience this includes 2.04 years in end to end recruitment cycle. ",
                "Hands on expertise in End2End Recruitment, People Management, Salary Negotiations, On Boarding, Induction & joining, Reporting etc. ",
                "Good experience in sourcing both Entry and lateral levels across verticals through job portals, social networking, head hunting, cold calling, job posting and referral networks internal/external. ",
                "Responsible for carrying out full-cycle recruitment (source, pre-qualify, interviewing, assess, extend/negotiate offers) for all positions, managing the interviewing and offer process for all candidates up to the on boarding process. ",
                "Good knowledge and work experience of recruitment for hiring consultants on both Contract and Full-time. ",
                "Ability to learn quickly and take up new tasks and responsibilities. ",
                "Ability to work effectively as an independent contributor and good team player ",
                "Proven ability to consistently and positively contribute in a high-paced, changing work environment. "
            ]
        },
        {
            "company": "MACH (INDIA) Pvt. Ltd, Bangalore",
            "role": "Client Relations and Customer Support",
            "dates": [
                "November 2005",
                "November 2009"
            ],
            "responsibilities": [
                "Handling complete Customer support circle. ",
                "Establishing an intensive network of Clients, fostering good relations with them and ensuring due diligence to operational process standards while controlling cost. ",
                "Implementing business-centric strategies that clinch repetitive business for the company post conducting of market research, analysis and forecasting. ",
                "Building teams of consistent performers, mentoring their skills in the achievement of corporate goals. ",
                "Organizing need based training process for clients and appraising their performance in the achievement of bottom-line goals. ",
                "Constructive feedbacks to trainees, which help them, see themselves as an important and integral part of the organization ",
                "Configuring the roaming agreements as per the client request. ",
                "Creating user ID and password for client ",
                "Handling escalated issues related to clients and other clearing house. ",
                "Knowledge of all clearing activities as per the GSM standard. ",
                "Configuring the AA.14 & IR21 document as per the client requirement. "
            ]
        }
    ],
    "projects": [],
    "honors": [],
    "activities": [],
    "userDetails": {
        "name": "Revathi H N",
        "skills": [
            "End2End Recruitment",
            "People Management",
            "Salary Negotiations",
            "On Boarding",
            "Induction & joining",
            "Reporting",
            "Sourcing",
            "Job Portals",
            "Social Networking",
            "Head Hunting",
            "Cold Calling",
            "Job Posting",
            "Referral Networks",
            "Client Relations",
            "New Business Development",
            "Client Services and Retention",
            "Negotiation",
            "Persuasion",
            "Closing Skills",
            "Effective Team Leadership",
            "Quality Control & Process Improvement",
            "Roaming Agreements",
            "Clearing House",
            "GSM Standard",
            "AA.14 & IR21 Document Configuration"
        ]
    }
}