{
    "certifications": [
        "AWS Certified Solutions Architect – Associate Level"
    ],
    "experiences": [
        {
            "company": "AT&T",
            "dates": [
                "July 2021 - Present"
            ],
            "role": "DevOps Engineer",
            "responsibilities": [
                "Plan, develop and assist the migration of client's on-premises infrastructure to Microsoft Cloud (Azure).",
                "Design and implement hybrid on premise and cloud migration and management strategy for the new hybrid cloud solution in single and multiple site data centers. Create Azure Automation Assets, Graphical Runbooks, PowerShell runbooks that will automate specific tasks, deployed Azure AD Connect, configuring ADFS authentication flow, ADFS installation using Azure AD Connect. Deployed Azure IaaS (VM’s) and PaaS role instances (Cloud services) into secure VNets with Azure Internal Load Balancers, subnets and created several SQL scripts as part of bug fixes to provide immediate solutions for some of the issues also created Azure PowerShell script for backup and restore operations for API Management. Implemented high availability with Azure Classic and Azure Resource Manager deployment models. Designed Network Security Groups (NSGs) to control inbound and outbound access to network interfaces (NICs), VMs and subnets. Worked on Server less services (Azure Functions) created and configured HTTP Triggers in the Azure Functions with Application insights for monitoring and performing load testing on the Application's using the VSTS. Created scripts that automate or improve the builds for all client-side platforms – iOS, Android, Windows, and Mac using Git and Jenkins, among other tools. Administered and Engineered Jenkins for managing weekly Build, Test and Deploy chain, SVN/GIT with Test/Prod Branching Model for weekly releases. Implemented Chef Recipes for Deployment on build for internal Data Centre Servers. Also, re-used and modified same Chef Recipes to create a Deployment directly into Amazon EC2 Instances. Writing Python scripts to automate services which includes Web servers, ELB, Cloud Front distribution, Database, EC2, database security groups and S3 bucket. Developing build and deployment scripts using ANT and MAVEN as build tools in Jenkins to move from one environment to other environments for Continuous Integration. Configured GIT with Jenkins and schedule jobs using POLLSCM option and integrated to automate the code checkout process. Wrote JUnit test cases for unit, integration, and functional tests, run automatically by Jenkins in the builds triggered by each push to GIT. Implemented a Continuous Integration and Continuous Delivery (CI/CD) pipeline with Docker, Jenkins, GitHub and Azure Container Service. Whenever a new GitHub branch gets started, Jenkins, our Continuous Integration (CI) server, automatically attempts to build a new Docker container from it, The Docker container leverages Linux containers and has the Azure Container baked in. Converted our staging and Production environment from a handful of Azure Nodes to a single bare metal host running Docker."
            ]
        },
        {
            "company": "Promethium, CA",
            "dates": [
                "Jan 2020 to June 2021"
            ],
            "role": "Site Reliability Engineer",
            "responsibilities": [
                "Setup and build AWS infrastructure various resources, VPC EC2, S3, IAM, EBS, Security Group, Auto Scaling, and RDS in Cloud Formation JSON templates. Developed strategy to migrate Dev/Test/Production from an enterprise VMware infrastructure to the IaaS Amazon Web Services (AWS) Cloud environment including runbook processes and procedures. Implemented AWS Lambda functions to run scripts in response to event in Amazon Dynamo DB table, S3 buckets, and HTTP requests using Amazon API Gateway. Also wrote AWS Lambda functions in python for AWS Lambda which invokes python scripts to perform various analytics on large data sets in EMR clusters. Performed POTs in Azure implementation and POC’s to implement in the Organization and involved in migration from AWS to Azure cloud. Involving in Implementation of various Azure cloud services, Azure storage, Azure active directory, and Azure Service Bus. Managing Clients Microsoft Azure based Paas and IAAS environment. Configured and deployed the Operations Management Suite (OMS) for monitoring and change tracking. Creating and Managing Virtual Machines in Windows Azure and setting up communication with the help of Endpoints. Configured Shared Access Signature (SAS) tokens and Storage Access Policies in Azure Cloud Infrastructure. Designed, configured and deployed Microsoft Azure for a multitude of applications utilizing the Azure stack (Including Compute, Web & Mobile, Blobs, ADF, Resource Groups, HD Insight Clusters, Azure SQL, Cloud Services, and ARM), focusing on Networking, high-availability, fault tolerance, and auto-scaling. Experience in writing test cases, modules and integrating with Jenkins. Worked with Terraform key features such as Infrastructure as code, Execution plans, Resource Graphs, Change Automation, and Implemented Terraform modules for the deployment of applications across Azure. Implemented Jenkins jobs to create Azure Infrastructure from GitHub repositories containing Terraform code and created on-premises active directory authentication using automation with Chef. Developed Chef Cookbooks to install and configure Apache, Tomcat, Splunk, Jenkins, WebLogic, Rundeck, and deployment automation and Integrated Jenkins, Rundeck, and Chef. Primarily used Ruby to write GIT applications and chef Recipes. Maintaining automated environment using Chef recipes and cookbooks and implemented bootstrap process. Implemented and managed Splunk monitoring and reporting infrastructure. Design and implementing new procedures for infrastructure migration using Chef. Experience in using Python’s packages like NumPy, Pandas, sklearn, selenium, scikit-learn, Boto. Created load test framework using Vegeta and configured API’s using Docker containers and Cassandra Instances at AWS ops works layers’ level. Integration of GIT with Jenkins to automate the code check-out process with the help of Jenkins DSL Plugin. Assisted users of Nagios internally in designing and maintaining production-quality dashboard. Involved in installation, Configuration, and Managed Nagios for Resource Monitoring/Network Monitoring/Log Trace Monitoring. Implemented CI/CD using Jenkins and configured DevSecOps strategies, used SAST (Static Analysis Security Testing) and DAST (Dynamic Analysis Security Testing) to eliminate security flaws, vulnerabilities present in the source code and running application. Worked on implementing test cases to follow DevSecOps strategy model that supports microservice applications via Jenkins pipelines. Added security layer on top of DevOps methodology and implemented security/vulnerability scans at every phase of DevOps life cycle starting from design to monitoring like FOSS, Fortify and DAST to create DevSecOps operational model. Migrate IaaS, PaaS, and SaaS instances between public and private clouds - Apache, RDBMS, Unix/Linux, NAS/SAN, LAN/WAN VPN, Security, IDS, Firewalls and Encryption. Designed, developed, and implemented unit tests and product features by using Groovy, Java. Implemented GIT feature branch methodology for build process and applied semantic versioning concepts in creating tags and release process of an application and automated the development life cycles by using webhooks and remote triggers through secure tokens. Configuring and managing of Chef Master server: updating and creating modules and pushing them to Chef Clients and deploying application operational scripts to webservers like Apache Tomcat and JBoss using manifests. Implemented Chef Recipes for Deployment on build for internal Data Centre Servers. Also, re-used and modified same Chef Recipes to create a Deployment directly into Amazon EC2 Instances. Writing Python scripts to automate services which includes Web servers, ELB, Cloud Front distribution, Database, EC2, database security groups and S3 bucket. Developing build and deployment scripts using ANT and MAVEN as build tools in Jenkins to move from one environment to other environments for Continuous Integration. Authoring pom.xml files, performing releases with the Maven release plugin, and managing artifacts in NEXUS repository and wrote custom settings.xml "
            ]
        },
        {
            "company": "Reliance Infra, Hyd",
            "dates": [
                "Jun 2017 – Dec 2019"
            ],
            "role": "DevOps Engineer",
            "responsibilities": [
                "Cloud watch monitoring of EC2 instances on CPU utilization, disk space and custom metrics and provided alerts to developers. Integrated AWS DynamoDB using AWS lambda to store the values of items and backup the Dynamo DB streams. Experienced in AWS Elastic Beanstalk for app deployments and worked on AWS lambda. Creating AMI Images and Cloud formation scripts to deploy instances and snapshots of EC2 instance, S3 backups are done on a regular basis. S3 backups are backed up as Glaciers when the data is not in usage. Performed S3 buckets creation, policies and on the IAM role based polices and customizing the JSON template and Glacier for storage and backup on AWS. Create automation and deployment templates for relational and NoSQL databases including MySQL, Cassandra and MongoDB in AWS. Managing Cluster nodes for Physical issues and escalating issues to respective vendors. Created featured develop release branches in GIT for different application to support releases and CI builds. Experience in Branching, Merging, Tagging and maintaining the version across the environments using SCM tools like GIT, Bitbucket and Subversion (SVN) on windows and Linux platforms. Provide the permissions and required access to all the pub/subtopics (GCP) and sinks to push/write the data to Stackdriver. Create custom log metrics using Stack driver logging (GCP) and create charts and alerts using the custom log metrics. Experience in Administering GIT in Distributed Environments, maintained and administered GIT source code tool. Automated Weekly releases with ANT/Maven scripting for Compiling Java Code, Debugging and Placing Builds into Maven Repository. Involved in Shell and Perl scripts for compilation and deployment processes and automation of builds and PowerShell for Windows deployment and Administration Extensively used MAVEN tool to do the builds, integrated MAVEN to Eclipse and did local builds. Jenkins administration to user access credentials, deployment email notification configuration for new users and using matrix plugins to manage Jenkins. Implemented Infrastructure automation through Ansible for auto provisioning, code deployments, software installation and configuration updates. Developed Ansible scripts for an automated server provisioning and Docker images for isolation, reducing the time between provisioning and deployment. Created VM in Google Cloud Platform (GCP), installed Docker, Docker swarm. Experience in Using Ansible and Ansible Tower as Configuration management tools, to automate repetitive tasks, quickly deploys critical applications, and proactively manage changes and in managing Ansible Playbooks with Ansible roles, group variables, inventory files copy and remove files on remote systems using file module. Implemented Infrastructure automation through Ansible for auto provisioning, code deployments, software installation and configuration updates. Virtualized the servers on AWS using the Docker, create the Docker files and version control to achieve Continuous Delivery goal on high scalable environment, used Docker coupled with load-balancing tool Nginx. Excellent working knowledge in configuring multiple WebLogic domains including machines, manage servers and cluster environments Extensively worked on Hudson, Jenkins, Bamboo, Build Forge for continuous integration (CI) and for End-to-End automation for all build and deployments. Configuring various jobs in Jenkins & Hudson for deployment of Java based applications and running test suites. Installed and configured Hudson/ Jenkins for Automating Deployments and providing an automation solution."
            ]
        },
        {
            "company": "Aurobindo Pharma, Hyd",
            "dates": [
                "Dec 2015-Apr 2017"
            ],
            "role": "Build & Release Engineer",
            "responsibilities": [
                "As member of Release Engineering group, redefined processes and implemented tools for software builds, patch creation, source control, and release tracking and reporting, on UNIX platform. Setting up the build and deployment automation for Java base project by using Jenkins and Maven. Responsible for creating and deploying builds on various WebLogic environments, testing in build environment and release to test team on scheduled time. Creating builds using power shell Scripts, ANT/Maven scripts manually and automated. Troubleshooting deployment and installation issues. Automated the Build Process using Jenkins. Maintained necessary back-up of the important files and documented Linux scripts for future reference. SVN administration like give access for branches and SVN repositories. Creating SVN repositories and give access rights to the authorized developers. Maintained and administered GIT source code tool. Created Branches, Labels and performed Merges in Stash and GIT. Installed and configured Jenkins for Automating Deployments and providing an automation solution. Integrated GIT into Jenkins to automate the code check-out process. Used Jenkins for automating Builds and Automating Deployments. Managed build results in Jenkins and deployed using workflows. Managed to deliver specific versions of various components of an application into target environments. Modeled the structure for multi-tiered applications orchestrate the processes to deploy each tier. Developed build and deployment scripts using ANT and MAVEN as build tools in Jenkins to move from one environment to other environments. Integrated delivery (CI and CD process) Using Jenkins, Nexus, Yum and puppet. Have used Confluence to create, share and discuss content and projects. Familiar and experienced with Agile Scrum development."
            ]
        }
    ],
    "projects": [],
    "education": {
        "institution": "Spire.Doc for Python",
        "degree": "N/A",
        "gpa": null,
        "graduation": "N/A",
        "courses": [
            "N/A"
        ]
    },
    "honors": [],
    "activities": [],
    "userDetails": {
        "name": "Supriya Baddam",
        "skills": [
            "Terraform",
            "Ansible",
            "Docker",
            "Kubernetes",
            "several scripting languages",
            "monitoring tools"
        ]
    }
}