{
    "certifications": [],
    "education": {
        "institution": "Sreenidhi Institute of Technology",
        "degree": "B.Tech in Electronics and Computer Engineering",
        "graduation": "N/A",
        "gpa": null,
        "courses": []
    },
    "experiences": [
        {
            "company": "Vanguard",
            "role": "Sr. Full Stack Java Developer",
            "responsibilities": [
                "Participated in design and development as a Core Java and J2EE Software developer. Understanding software requirement and utilizing apposite technology to enunciate most apposite data flow between front end and back-end technologies. Extensive use of core Java Collections, Generics, Exception Handling, and Design Patterns for functionality, such as portfolio summary and user information. Designed the Front End using Angular 7/8, Node.js, Typescript, HTML5, CSS4, Bootstrap 4, Javascript, Ajax, JQuery, JSP and Spring Tag Libraries. Node.js libraries NPM, gulp directories to generate desired view and flux to root the URL's properly. Bootstrap and Angular Material for creating rich, Responsive UI Screens for varying screen sizes and devices. Implemented application architecture of the System based on Spring MVC and J2EE specifications. Implemented SOA architecture with web services using SOAP, WSDL, UDDI and XML. Created various Angular directives, controllers, DOM expressions, templates, data binding etc. Created the single page application using Angular 8 and the state of the application is kept in store and is accessed using Ngrx selectors wherever needed. Doing impact analysis and creating High Level Design Document and Authoring guide. Involved in discussion with architectural discussions on implements SPA pages using AEM & Angular. Developed applications using new features of Java 8 (lambda expressions, stream API’s, Collection API’s, Functional Interfaces). Build REST by building Node.js Server in the back end to handle requests sent from the front-end jQuery Ajax calls. Used of Node.js mainly used for authentication, authorization, and session maintenance. Worked closely with Spring Data main modules like Spring Data Commons, Spring Data Gem fire, Spring Data Key value, Spring Data Mongo DB, Spring Data REST. Extensively used various modules in spring like AOP, DI (IOC), Bean Wiring, Spring Inheritance, Auto Wiring, Spring JDBC Templates and Spring Quartz Schedulers for Jobs. Implemented Spring Circuit breaker pattern, integrated Hystrix dashboard to monitor spring micro services. Implemented Authentication & Authorization with Site Minder and spring security. Ability to write Spring batch jobs for updating bulk records at specified intervals of time. Written Storm topology to accept events from Kafka Cluster (using Zookeeper) producer emit into Mongo DB. Spring Ribbon API for load balancing and instances health check. Spark to deploy cluster manager through interface. Analysed, designed and implemented DAO pattern for accessing Oracle 11g database using connection pool. Developed application service components and configured beans using Spring IOC, creation of Hibernate mapping files and generation of database schema. Managing the OpenShift cluster that includes scaling up and down the AWS app nodes. Worked on Hibernate with Spring Integration as the data abstraction to interact with the database and used dependency injection (DI) using spring framework and annotations. Configured Hibernate session factory to integrate Hibernate with spring and used JPA/Hibernate to communicate with data layer and XML to read XML data. Developed application service components and configured beans using Spring IOC, creation of Hibernate mapping files and generation of database schema. Hands on experience with Mongo DB Installation, Configuring, Monitoring and Designing. Wrote Mongo DB models and schema by using Mongoose to query data. Implementing Linux features on windows through VM’s, UI’s and cloud shell in GCP/AWS. Manipulated data using CRUD operations of MongoDB and Oracle database management system and handled database access and data transmission based on RESTful web service. Implemented Micro Services based Cloud Architecture on AWS Platform. Implementing the Microservices to base on RESTful API utilizing Spring Boot with Spring MVC. Integrated Spring Cloud with Amazon Web Services to interact with AWS provided services. Migration of Existing Application to AWS cloud. Used Amazon Web Services AWS like EC2, EBS, S3, RDS, Cloud Watch and Cloud Front for promoting code in various environments. Used Spring Boot to build cloud Microservices and develop spring-based applications with very less configuration. Implemented functionalities using Spring IO / Spring Boot with Thyme leaf and Hibernate ORM. Migrating existing application into REST based Microservices to provide the CRUD capabilities using Spring Boot. Experience in configuring session affinity, session persistence and monitoring in Jboss. Uses the Microservices architecture with Spring Boot based services interacting through a combination of REST and Apache Kafka message brokers. Worked on creation of custom Docker container images, tagging and pushing the images. Created the Docker containers and Docker consoles for managing the application life cycle. Drools Decision table using excel sheets with a Spring MVC project. Developed CI/CD system with Jenkins on Kubernetes environment, utilized Kubernetes and Docker for the runtime environment for the CI/CD system to build, Test and Deploy. Jenkins for continuous integration (CI) and continuous deployment (CD). Apache Maven as the software build tool and Log4J for logging errors and messages. Java 8/9 features such as Lambda Expressions to make the code concise and Stream API to increase the performance and manage some of the AWS Services. Maven as build and dependency management tool for creating EAR, WAR and JAR file to be deployed in application servers and integrated with Jenkins, and Jenkins Jobs. Developed test cases and performed unit test using JUnit Framework. Extensively worked in Test Driven Development (TDD) framework using Junit5. JIRA for Project Management, Bug Tracking and Issue Tracking. GIT for version repository maintenance. Environment: Java 1.8, Spring, Hibernate, J2EE, Javascript, JIRA, Angular 7/8, Tomcat, Jenkins, REST, Kubernetes, SAML, MVC, LDAP, HTML5, CSS3, JSP, Oracle 12c/ 11g, Mongo DB, PostgreSQL, Agile, Junit, Log4j, Kafka, Web services, AWS, Docker 2, CI/CD, Junit, Hibernate, Microservices, PLSQL, JIRA, Spring Security, XML, Ajax."
            ],
            "dates": [
                "August 2021 - Present"
            ]
        },
        {
            "company": "Capital One",
            "role": "Sr. Full Stack Java Developer",
            "responsibilities": [
                "Involved in various phases of SDLC including creating design documentation, development (with browser compatibility), unit testing (in multiple browsers) of application. Followed Agile principles and methodologies to achieve quality product by interacting with different teams. Developing UI using Spring MVC framework, JSP, JSTL, HTML5, CSS, JavaScript, JQuery, AJAX and Angular 6/7. Created Reusable Modules and Custom Directives in Angular 6 which got used in various places of application. Made use of Core Java concepts such as OOP Concepts, Collections Framework, and Exception Handling, I/O System, Multi-Threading, JDBC, Generics. Used Java 8 features in developing the code like Lambda expressions, creating resource classes, fetching documents. Developed JSP, HTML, CSS and a part of presentation layer using JavaScript, Angular 6/7 and React JS. Involved in complete Agile/SDLC Requirement Analysis, Development, System and Integration testing. Installed and configured multiple Jenkin jobs for deployment. Implemented Spring boot Microservices to process the messages into the Kafka cluster setup and implemented Kafka producer and consumer applications on Kafka cluster setup with help of Zookeeper. Used Angular 7 for maintaining heavy load of application to maintain responsive with minimal memory overhead. Created Typescript reusable components to consume REST API's using Component based architecture by Angular. Developed Apache Camel routes and defined JMS endpoints for message processing and routing. Core Java development and Support of Java/J2EE applications with emphasis on OOP-based web forms, business logic, database access components. Created Directives, Services, Filters using Angular with Typescript. Deployed the Services onto the OpenShift PODS and tested end-to-end application. Implemented React JS Controllers to maintain view data where the client implemented the UI using React JS. Created custom, self-contained, reusable and testable Angular modules, controllers, directives and services to implement key functionalities for customer account summary. Used React JS to create views to hook up models to the DOM and synchronize data with server as a SPA. Involved in multi-tier Java and J2EE based applications support, responsible for writing business logic using core Java, SQL queries for the backend RDBMS. Worked with React JS for templating for faster compilation and developing reusable components. Implemented the Spring AOP Aspect Oriented Programming for Logging, declarative Transaction Management, creating and applying transaction advice and configuring the joint points. Designed and coded the J2SE solver, used to solve differential equations for the multithreaded simulation. Maintaining strong cohesion within a single Microservice facilitating some degree of reusability loosely coupled Microservices. Worked in Stream of API for Bulk Data Operations on Collections and API improvements in Java 8. Worked in using React JS components, Forms, Events, Keys, Router, Animations and Flux concept. Used Jenkins pipelines to drive all Microservices builds out to the Docker registry and then deployed to Kubernetes. Worked with Complex SQL queries, Functions and Stored Procedures. Design and develop spark programs to filter, transform data using RDD, Dataset/Data Frame APIs. Fetching user details from third party applications using Oauth 2 Authentication. Worked with NoSQL database MongoDB and developed custom MongoDB applications specific to client needs and Developed PL-SQL store procedures to convert the data from Oracle to MongoDB. Migrated tables from SQL Server to PostgreSQL, which are being used actively till date. Working with Oauth 2 to provide authentication and authorization to Rest services by exchanging Access tokens. Implemented Spring Boot Microservices to divide the application into various sub modules. Used Amazon Elastic search service for application monitoring and full text search. GWT and Amazon AWS (EC2/S3/EBS) for prototyping and subsequent evaluation. Made use of average aggregations metrics in Elastic Search to look for specific numeric field in various documents. JBOSS application server for run time integration of j2ee applications. Used Apache CXF for building and developing services and used frontend programming API s like JAX WS and JAX-RS. Involved in the development of Microservices for all the models using combination of Spring Boot and Spring Security. Developed various helper classes needed following Core Java Multi-threaded programming and Collection classes. Used Java  Method References feature to point to methods by their names and used functional Interfaces. Designed and built the reporting application that uses the Spark SQL to fetch and generate reports. Experience in migrating data from Oracle 11g database using Spring JDBC to PostgreSQL DB. Developed and implemented spring, JSF and J2EE based MVC framework for the application. Used Spring Boot for developing Microservices, and API’s to communicate Oracle DB for handling real time feeds. Design and implement disaster recovery for the PostgreSQL Database. Developed REST API for test server for Express Router middleware-based API's with MongoDB. Developed Servlets and JSPs based on MVC pattern using Struts 2 framework and Spring Framework. Experience in using JSP and Servlets to create web interfaces and integrating apache tools like Kafka. Modified existing Shell scripts in Unix to call daily sub routines. Deployed Docker contained Spring REST services into AWS EC2 container service using AWS admin console and used lambda to run applications in AWS console. Used Maven to build and Apache Tomcat to deploy the application. Configured Jenkins in Micro Service apps for deploying and implemented Jenkins for the central build. Implemented persistence layer using Custom DAOs to handle CRUD operations. Developing, maintaining, and following coding standards using Test Driven Development TDD. OpenShift Administer, secure, and maintain multiple Kubernetes clusters to support a global service. Developed PL/SQL procedure for login module and registration module. Involved in creating basic SQL for CRUD operations and advanced SQL for procedures. Worked with IDE as Eclipse and deployed into Apache Tomcat Server and WebSphere Application Server. Used Maven for building Java applications as well as Jenkins for CI/CD support."
            ],
            "dates": [
                "May 2020 - July 2021"
            ]
        },
        {
            "company": "EMD Millipore",
            "role": "Sr. Full Stack Java Developer",
            "responsibilities": [
                "Worked with Business and Development teams to understand requirements, and to determine scope of development. Involved in requirement gathering and technical design meetings. Involved in Daily Stand-Up Meetings, Sprint Planning and Backlog Grooming for Agile Scrum Process. Involved in preparing the Documentation of the project to understand the system efficiently. Developed User Interface application modules using HTML5, CSS3 and JavaScript, JSON, jQuery and AJAX. Used Angular 4 to create a Single Page Application (SPA) which can bind data to specific views and synchronize data with server using LESS. Proficient in filtering data by using APIs before displaying in the browser using Angular 4. Focused on front-end design utilizing JSF framework along with AJAX and other JavaScript technologies as well as design of business objects with Hibernate ORM. Injecting dependencies into code using spring core module concepts like IOC (Inversion of Control) of Spring Framework. Contributed for Migrating synchronous SCAC interface module into Microservices. Core service uses the main database and the other Microservices use their individual databases to access and store data. Implemented the Spring Restful Template to retrieve the data from the other system using JSON. Implemented the Caching mechanism and refreshing the Caching mechanism using EH Cache. Designing and implementing scalable, RESTful and microservices based mobile back-end. The back end is being written in Java using Spring Boot for simplicity and scalability. Responsible for creating and maintaining architecture for Restful API using Spring Boot. Integrated Apache Camel (ESB) with spring boot. Implemented protective resources like SSO and OAuth 2 using Spring Cloud. Develop the micro-service in spring cloud framework to support Next generation cloud framework. Analysed the SQL scripts and designed the solution to implement using Scala. Built data access subsystems using Hibernate and spring against stored procedures on a DB2 database. Developed REST services to talk with adapter classes and exposed them to front-end. Building/Maintaining Docker/ Kubernetes container clusters managed by Kubernetes Linux, Bash, GIT, Docker, on GCP. Used Maven for building and added lot of external dependencies. Used Atlassian Bamboo, Bitbucket and Jira products for continuous integration. Worked in container-based technologies like Docker, Kubernetes and OpenShift. Implemented bamboo for Continuous Integration Builds and Notifications. Implemented Jenkins and connected it to Bitbucket and Jira. Worked with Mocking while running JUnit test cases for batch processing. Integrated Log4j framework into the Application."
            ],
            "dates": [
                "April 2018 - April 2020"
            ]
        },
        {
            "company": "CMC Limited – India",
            "role": "Java Developer",
            "responsibilities": [
                "Went through the business requirements, understand, and analysed them in scrum meetings and preparing specifications for the requirements. Implemented modules into Node JS to integrate with designs and requirements. Involved in developing front end screens using JSP, XLTS, DHTML, HTML, CSS and JavaScript. Designed and coded the J2SE solver, used to solve differential equations for the multithreaded simulation. Implemented Spring MVC and Spring Dependency Injection (DI) features along with Hibernate. Designed and developed the REST based Microservices using the Spring Boot. Development of Servlets, JSP files and involved in developing J2EE design architecture. Modularized frontend CSS and JS code with Sass. Built, analytics web service with Node.js. Designed and implemented the presentation layer using Java Server Pages (JSP), tag libraries, and (CSS). Used Couchbase to view the document structure and Query APIs. Used Node.js framework for better organization of the code. Created SQL queries for diverse usage ensured integrity of data with frequent restoration and back up. Implemented Microservices development using spring boot and deployment in Pivotal Cloud Foundry (PCF). Used Hibernate Criteria Queries and Hibernate Query Language (HQL) for optimized searching of huge data sets. Deploying and testing the application in Web Sphere App server. Used in-built marketplace services of PCF for RabbitMQ, MySQL config. Restful API’s are created to handle real-time request/response. Used Docker to virtualize deployment containers and push the code to instances cloud using PCF. Installed PCF on instance to manage the containers created by PCF. Worked with stateless session beans on the middle tier. Developed and implemented search feature using Ajax. Developed Restful Web Services and to consume JSON messages. Responsible in configuring and setting-up Apache Tomcat Server for the development phase. Created use case diagrams, activity diagrams, class diagrams, workflow process diagrams using Visio. Used Maven as a build tool and GIT as version control tool."
            ],
            "dates": [
                "Feb 2016 – Feb 2018"
            ]
        },
        {
            "company": "Visa, India",
            "role": "Jr Java Developer",
            "responsibilities": [
                "Extensive experience in Cross-browser HTML, CSS & JavaScript coding to offer responsive website layouts to modern browsers and mobile devices. Developed Business tier and Presentation tier using Struts, JSP. Coding using JSP, HTML, and CSS JavaScript for validation, Servlets using STRUTS framework, JDBC. Worked on using CSS pre-processors like SASS and LESS by extending CSS with dynamic behaviour such as variable, operation and functions. Developed user interface by using the React JS, Flux for SPA development. Used React JS for templating for faster compilation and developing reusable components. Developed user interfaces for policy owner module using JSPs, Struts Tag Library, and Tiles framework. Modularized frontend CSS and JS code with Sass. Built, analytics web service with Node.js. Used Decorators to optimize the code reusability and worked with services, providers in Node JS. Implemented Routes in Node JS. Deployed Microservices/Cloud Native App's in Pivotal Cloud Foundry PCF (Paas). Involved in hosting the application in Pivotal Cloud Foundry (PCF) and deployed, Scaled, Configured, wrote manifest file for various Microservices in PCF. Involved in Micro services development using spring boot and deployment in Pivotal Cloud Foundry (PCF). Responsible for creating web and website-based applications using JavaScript, Node JS. Used new Java 8 features, such as Lambda expressions, Streams and Functional Interfaces. Developed JSP pages which are represented as view in MVC model. Wrote SQL, PL/SQL for retrieve, insert and update data to the database. Configured Jenkins in Micro Service apps for deploying and implemented Jenkins for the central build. Implemented persistence layer using Custom DAOs to handle CRUD operations. Developing, maintaining, and following coding standards using Test Driven Development TDD. OpenShift Administer, secure, and maintain multiple Kubernetes clusters to support a global service. Developed PL/SQL procedure for login module and registration module. Involved in creating basic SQL for CRUD operations and advanced SQL for procedures. Worked with IDE as Eclipse and deployed into Apache Tomcat Server and WebSphere Application Server. Used Maven for building Java applications as well as Jenkins for CI/CD support."
            ],
            "dates": [
                "Mar 2015 - Jan 2016"
            ]
        }
    ],
    "projects": [],
    "honors": [],
    "activities": [],
    "userDetails": {
        "name": "Suraj Nammi",
        "skills": [
            "Java",
            "C++",
            "SQL and PL/SQL",
            "JSE, JDBC, JPA, AJAX, JSP, Servlets, EJB, JMS, JSTL, JNDI",
            "HTML5, DHTML, CSS3, JavaScript, AngularJS, Angular, Node.js, React JS, jQuery Bootstrap, XML, XSD, XSL/XSLT, AJAX, jQuery, JSON, Typescript, SASS, JSP",
            "REST, SOAP, WSDL, SAAJ, SAXJ, RESTful, AWS, Microservices, JAXB, Apache-CXF",
            "Hibernate, iBatis, MyBatis",
            "WebLogic, Web Sphere, Oracle Glassfish, Wildfly, Jboss, Apache Tomcat",
            "Struts, JSF, Spring Framework, Spring MVC, Spring Boot, Spring Cloud, Spring Batch, Spring Core, Spring Hibernate, Spring JDBC, Spring Security",
            "Oracle, MySQL and SQL Server, MongoDB, Cassandra",
            "Windows, Linux and Solaris",
            "NetBeans, Eclipse, IntelliJ, RAD",
            "CVS, SVN, Bamboo, GIT",
            "JUnit, Log4J, DOM",
            "ANT, Maven, Gradle, Jenkins, Jira, Rally, Ansible, puppet",
            "AWS (Elastic Search, Fargate, EC2, S3, EMI, ELB, Dynamo DB), Docker,Azure, PCF"
        ]
    }
}